
## Terraform plan for environment: `dev`

**Commit:** 2c42cba3f069b57ecbe34a351bd78cc9e4255f0d


**API version:** 9e1eaa40e4
**CLI version:** 9e1eaa40e4
**Selfserve version:** 9a7cb0edb6
**Internal version:** 9a7cb0edb6
**search version:** 805133fd06

### Plan summary

`34 to add, 0 to change, 34 to destroy`

**🆕 Creates**

```tf
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-transxchange-consumer"]
```
**🗑️ Deletes**

```tf
module.service.module.eventbridge.aws_scheduler_schedule.this["clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["transxchange-consumer"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.service.module.eventbridge.aws_scheduler_schedule.this["clean-up-variations"] will be destroyed
  # (because key ["clean-up-variations"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/clean-up-variations-schedule" -> null
      - description                  = "Schedule for vol-app-dev-clean-up-variations" -> null
      - group_name                   = "default" -> null
      - id                           = "default/clean-up-variations-schedule" -> null
      - name                         = "clean-up-variations-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:100"
                  - JobName                    = "vol-app-dev-clean-up-variations"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["close-expired-windows"] will be destroyed
  # (because key ["close-expired-windows"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/close-expired-windows-schedule" -> null
      - description                  = "Schedule for vol-app-dev-close-expired-windows" -> null
      - group_name                   = "default" -> null
      - id                           = "default/close-expired-windows-schedule" -> null
      - name                         = "close-expired-windows-schedule" -> null
      - schedule_expression          = "cron(45 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:100"
                  - JobName                    = "vol-app-dev-close-expired-windows"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["cns"] will be destroyed
  # (because key ["cns"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/cns-schedule" -> null
      - description                  = "Schedule for vol-app-dev-cns" -> null
      - group_name                   = "default" -> null
      - id                           = "default/cns-schedule" -> null
      - name                         = "cns-schedule" -> null
      - schedule_expression          = "cron(30 13 ? * 1 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:100"
                  - JobName                    = "vol-app-dev-cns"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["company-profile-dlq"] will be destroyed
  # (because key ["company-profile-dlq"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/company-profile-dlq-schedule" -> null
      - description                  = "Schedule for vol-app-dev-company-profile-dlq" -> null
      - group_name                   = "default" -> null
      - id                           = "default/company-profile-dlq-schedule" -> null
      - name                         = "company-profile-dlq-schedule" -> null
      - schedule_expression          = "cron(0/30 8-17 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:100"
                  - JobName                    = "vol-app-dev-company-profile-dlq"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["create-psv-licence-surrender-task"] will be destroyed
  # (because key ["create-psv-licence-surrender-task"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/create-psv-licence-surrender-task-schedule" -> null
      - description                  = "Schedule for vol-app-dev-create-psv-licence-surrender-task" -> null
      - group_name                   = "default" -> null
      - id                           = "default/create-psv-licence-surrender-task-schedule" -> null
      - name                         = "create-psv-licence-surrender-task-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:100"
                  - JobName                    = "vol-app-dev-create-psv-licence-surrender-task"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-clean-up-variations"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-clean-up-variations"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-clean-up-variations-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:100"
                  + JobName                    = "vol-app-dev-clean-up-variations"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-close-expired-windows"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-close-expired-windows"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-close-expired-windows-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:100"
                  + JobName                    = "vol-app-dev-close-expired-windows"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-cns"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-cns"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-cns-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(30 13 ? * 1 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:100"
                  + JobName                    = "vol-app-dev-cns"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-company-profile-dlq"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-company-profile-dlq"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-company-profile-dlq-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:100"
                  + JobName                    = "vol-app-dev-company-profile-dlq"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-create-psv-licence-surrender-task"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-create-psv-licence-surrender-task"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-create-psv-licence-surrender-task-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:100"
                  + JobName                    = "vol-app-dev-create-psv-licence-surrender-task"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-digital-continuation-reminders"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-digital-continuation-reminders"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-digital-continuation-reminders-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:100"
                  + JobName                    = "vol-app-dev-digital-continuation-reminders"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-duplicate-vehicle-warning"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-duplicate-vehicle-warning"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-duplicate-vehicle-warning-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(30 13 ? * 2-6 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:100"
                  + JobName                    = "vol-app-dev-duplicate-vehicle-warning"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-enqueue-ch-compare"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-enqueue-ch-compare"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-enqueue-ch-compare-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 13 ? * 3 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:100"
                  + JobName                    = "vol-app-dev-enqueue-ch-compare"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-expire-bus-registration"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-expire-bus-registration"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-expire-bus-registration-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(05 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:100"
                  + JobName                    = "vol-app-dev-expire-bus-registration"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-flag-urgent-tasks"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-flag-urgent-tasks"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-flag-urgent-tasks-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:100"
                  + JobName                    = "vol-app-dev-flag-urgent-tasks"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-inspection-request-email"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-inspection-request-email"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-inspection-request-email-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:100"
                  + JobName                    = "vol-app-dev-inspection-request-email"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-interim-end-date-enforcement"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-interim-end-date-enforcement"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-interim-end-date-enforcement-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:100"
                  + JobName                    = "vol-app-dev-interim-end-date-enforcement"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-international-goods-export"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-international-goods-export"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-international-goods-export-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 ? * 1 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:100"
                  + JobName                    = "vol-app-dev-international-goods-export"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-last-tm-letter"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-last-tm-letter"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-last-tm-letter-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(30 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:100"
                  + JobName                    = "vol-app-dev-last-tm-letter"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-licence-status-rules"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-licence-status-rules"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-licence-status-rules-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:100"
                  + JobName                    = "vol-app-dev-licence-status-rules"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-mark-expired-permits"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-mark-expired-permits"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-mark-expired-permits-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(15 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:100"
                  + JobName                    = "vol-app-dev-mark-expired-permits"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-company-profile"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-company-profile"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-company-profile-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/5 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:100"
                  + JobName                    = "vol-app-dev-process-company-profile"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-inbox"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-inbox"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-inbox-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 13 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:100"
                  + JobName                    = "vol-app-dev-process-inbox"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-insolvency"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-insolvency-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:100"
                  + JobName                    = "vol-app-dev-process-insolvency"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency-dlq"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-insolvency-dlq"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-insolvency-dlq-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/30 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:100"
                  + JobName                    = "vol-app-dev-process-insolvency-dlq"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-ntu"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-ntu"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-ntu-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 18 ? * 2-6 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:100"
                  + JobName                    = "vol-app-dev-process-ntu"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-community-licences"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-community-licences"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-community-licences-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:100"
                  + JobName                    = "vol-app-dev-process-queue-community-licences"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-generation"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-disc-generation"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-disc-generation-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:100"
                  + JobName                    = "vol-app-dev-process-queue-disc-generation"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-disc-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-disc-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/15 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:100"
                  + JobName                    = "vol-app-dev-process-queue-disc-print"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-ecmt-accept"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-ecmt-accept"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-ecmt-accept-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:100"
                  + JobName                    = "vol-app-dev-process-queue-ecmt-accept"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-general"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-general"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-general-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:100"
                  + JobName                    = "vol-app-dev-process-queue-general"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-irhp-allocate"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-irhp-allocate"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-irhp-allocate-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:100"
                  + JobName                    = "vol-app-dev-process-queue-irhp-allocate"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-generation"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-permit-generation"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-permit-generation-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:100"
                  + JobName                    = "vol-app-dev-process-queue-permit-generation"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-permit-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-permit-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/15 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:100"
                  + JobName                    = "vol-app-dev-process-queue-permit-print"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-print"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-queue-print"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-process-queue-print-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:100"
                  + JobName                    = "vol-app-dev-process-queue-print"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-psv-operator-list-export"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-psv-operator-list-export"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-psv-operator-list-export-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(00 13 ? * 1 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:103"
                  + JobName                    = "vol-app-dev-psv-operator-list-export"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-remove-read-audit"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-remove-read-audit"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-remove-read-audit-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 13 ? * 1 *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:100"
                  + JobName                    = "vol-app-dev-remove-read-audit"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-resolve-payments"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-resolve-payments"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-resolve-payments-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/5 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:100"
                  + JobName                    = "vol-app-dev-resolve-payments"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["dev-transxchange-consumer"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-transxchange-consumer"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "dev-transxchange-consumer-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0/2 8-17 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:100"
                  + JobName                    = "vol-app-dev-transxchange-consumer"
                  + JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  + SchedulingPriorityOverride = 1
                  + ShareIdentifier            = "volapp"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["digital-continuation-reminders"] will be destroyed
  # (because key ["digital-continuation-reminders"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/digital-continuation-reminders-schedule" -> null
      - description                  = "Schedule for vol-app-dev-digital-continuation-reminders" -> null
      - group_name                   = "default" -> null
      - id                           = "default/digital-continuation-reminders-schedule" -> null
      - name                         = "digital-continuation-reminders-schedule" -> null
      - schedule_expression          = "cron(00 13 * * ? *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:100"
                  - JobName                    = "vol-app-dev-digital-continuation-reminders"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ShareIdentifier            = "volapp"
                }
            ) -> null
          - role_arn = "arn:aws:iam::054614622558:role/vol-app-dev-batch-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["duplicate-vehicle-warning"] will be destroyed
  # (because key ["duplicate-vehicle-warning"] is not in for_each map)
  - resource "aws_scheduler_schedule" "this" {
      - arn                          = "arn:aws:scheduler:eu-west-1:054614622558:schedule/default/duplicate-vehicle-warning-schedule" -> null
      - description                  = "Schedule for vol-app-dev-duplicate-vehicle-warning" -> null
      - group_name                   = "default" -> null
      - id                           = "default/duplicate-vehicle-warning-schedule" -> null
      - name                         = "duplicate-vehicle-warning-schedule" -> null
      - schedule_expression          = "cron(30 13 ? * 2-6 *)" -> null
      - schedule_expression_timezone = "UTC" -> null
      - state                        = "ENABLED" -> null
        # (4 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob" -> null
          - input    = jsonencode(
                {
                  - JobDefinition              = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:100"
                  - JobName                    = "vol-app-dev-duplicate-vehicle-warning"
                  - JobQueue                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                  - SchedulingPriorityOverride = 1
                  - ... (truncated, see full plan in the workflow run logs)
```

</details>